# ABOUT PYTHON PROGRAMMING

In [ ]:
# PYTHON PROGRAMMING CAN BE DONE IN 3 APPLICATIONS
# 1. PYTHON JUPYTER NOTEBOOK
# 2. PYSPYDER IDE
# 3. PYCHARM IDE

# PYTHON PROGRAMMING IS VERY MUCH CASE SENSITIVE

In [ ]:
# WHEN WE CREATE A VARIABLE AND INSERT VALUES TO THE VARIABLE
# BOTH ARE VERY MUCH CASE SENSITIVE IN TERMS CALLING TEH PROGRAM ON THIS
# PYTHON STATEMENT,FUNCTIONS,OPTIONS AND VARIABLES ARE VERY MUCH CASE SENSITIVE

In [ ]:
INSTITUTE="DV ANALYTICS"

INSTITUTE

In [ ]:
PRINT(INSTITUTE)

In [ ]:
print(INSTITUTE)

In [ ]:
print(institute)

# HOW TO DEFINE VARIABLE, VALUES AND DATA TYPES

In [ ]:
A=100
A

In [ ]:
A=100
B=200
C=A+B
C

In [ ]:
# ADDITION BY EXPRESSION
100+200

In [ ]:
# SUBSTRACTION BY EXPRESSION
200-100

In [ ]:
# MULTIPLICATION BY EXPRESSION
100*200

In [ ]:
# DIVISION BY EXPRESSION
200/100

In [ ]:
#TO GET REMAINDER
150%100

In [ ]:
#TO GET QUOTIENT
150//100

In [ ]:
# TO GET POWER
10**2

# VARIABLE VALUES

In [ ]:
A=100
B=200
C=A+B
C

In [ ]:
A=100
B=200
C=B-A
C

In [ ]:
A=100
B=200
C=A*B
C

In [ ]:
A=100
B=200
C=B/A
C

In [ ]:
A=150
B=100
C=A%B
C

In [ ]:
A=150
B=100
C=A//B
C

In [ ]:
FIRST_NAME='BHUPIT'
LAST_NAME='BEHL'
FULL_NAME=FIRST_NAME+' '+LAST_NAME
FULL_NAME

In [ ]:
print(FULL_NAME)

In [ ]:
# CHARACTER VALUE IN LOOPING AND REPEATATION

INSTITUTE='DV'
print(INSTITUTE*10)

In [ ]:
INSTITUTE='DV\n'
print(INSTITUTE*10)

# DEFINING DATA READING PATH IS VERY MUCH CASE SENSITIVE

In [ ]:
#ERROR
print ('C:\Users\Debendra\CRASH COURSE 2022\PART-1\A2.RAW_DATA\MED_STORE_2022.xlsx')

In [ ]:
#CORRECT
print (r'C:\Users\Debendra\CRASH COURSE 2022\PART-1\A2.RAW_DATA\MED_STORE_2022.xlsx')

In [ ]:
#ERROR
print ('C:\Users\Debendra\CRASH COURSE 2022\PART-1\n2.RAW_DATA\MED_STORE_2022.xlsx')

In [ ]:
#CORRECT
print (r'C:\Users\Debendra\CRASH COURSE 2022\PART-1\n2.RAW_DATA\MED_STORE_2022.xlsx')

In [ ]:
# WHEN WE READ DATA FROM A PATH USING \a OR \n. SUCH CASES WE MUST USE r'PATH'

# UNDERSTAND DATA TYPES IN PYTHON

In [ ]:
A=100
B=12.34
C=100+300j
NAME='BHUPIT BEHL'

In [ ]:
#UNDERSTAND DATA TYPES

type(A)

In [ ]:
type(B)

In [ ]:
type(C)

In [ ]:
type(NAME)

# DEFINE VARIABLES BY TYPES LIKE LIST,TUPLE,SET AND DICTIONARY

In [ ]:
# LIST VARIABLE
NAME=['PRABHANSHU','VALENTINA','CHANDRAKANT','ABINASH','SRAVANI']

NAME

In [ ]:
type(NAME)

In [ ]:
# TUPLE VARIABLE
NAME=('PRABHANSHU','VALENTINA','CHANDRAKANT','ABINASH','SRAVANI')

NAME

In [ ]:
type(NAME)

In [ ]:
# SET VARIABLE
NAME={'PRABHANSHU','VALENTINA','CHANDRAKANT','ABINASH','SRAVANI'}

NAME

In [ ]:
type(NAME)

In [ ]:
# DICTIONARY VARIABLE
NAME={'PRABHANSHU':25,'VALENTINA':27,'CHANDRAKANT':28,'ABINASH':30,'SRAVANI':30}

NAME

In [ ]:
type(NAME)

In [ ]:
# DEFINING RANEG AS A DATA TYPE
ROW_NUM=range(0,10)

ROW_NUM

In [ ]:
list(ROW_NUM)

In [ ]:
type(ROW_NUM)

# LIST ALL THE DATA TYPES IN PYTHON

In [ ]:
# INTERVIEW QUESTION WILL COME , LIST OUT ALL THE DATA TYPES IN PYTHON YOU HAVE WORKED WITH
# 1. INT
# 2. FLOAT
# 3. STR
# 4. COMPLEX
# 5. LIST
# 6. TUPLE
# 7. SET
# 8. DICT
# 9. RANGE

# HOW TO RETRIEVE VALUES BY GIVEN POSITIONS

In [ ]:
INSTITUTE='DV ANALYTICS'

len(INSTITUTE)

In [ ]:
INSTITUTE[0]

In [ ]:
INSTITUTE[1]

In [ ]:
INSTITUTE[2]

In [ ]:
INSTITUTE[-1]

In [ ]:
INSTITUTE[-2]

In [ ]:
INSTITUTE[0:]

In [ ]:
INSTITUTE[0:2]

In [ ]:
INSTITUTE[3:]

In [ ]:
INSTITUTE[0:0]

In [ ]:
INSTITUTE[1:1]

In [ ]:
INSTITUTE[-1:1]

In [ ]:
#CALL VALUES FROM LIST

STU_ID=['S1','S2','S3','S4','S5']
STU_ID

In [ ]:
len(STU_ID)

In [ ]:
print(STU_ID[0])

In [ ]:
print(STU_ID[3])

# VARIABLES UPDATE,DELETE AND APPENDING

In [ ]:
NAME=['PRABHANSHU','VALENTINA','CHANDRAKANT','ABINASH','SRAVANI']

NAME

In [ ]:
# UPDATING LIST
NAME[2]='LISA'

NAME

In [ ]:
# DELETING LIST
del NAME[2]

NAME

In [ ]:
NAME=['PRABHANSHU','VALENTINA','CHANDRAKANT','ABINASH','SRAVANI']
AGE=[25,28,28,30,30]

In [ ]:
NAME

In [ ]:
AGE

In [ ]:
# APPENDING LIST VALUES
FULL_DETAILS=NAME+AGE
FULL_DETAILS

In [ ]:
# LIST CAN BE UPDATED,DELETED AND APPENED

In [50]:
NAME=('PRABHANSHU','VALENTINA','CHANDRAKANT','ABINASH','SRAVANI')

NAME

('PRABHANSHU', 'VALENTINA', 'CHANDRAKANT', 'ABINASH', 'SRAVANI')

In [51]:
type(NAME)

tuple

In [52]:
# UPDATING TUPLE IS NOT POSSIBLE
NAME[2]='LISA'

NAME

TypeError: 'tuple' object does not support item assignment

In [53]:
# DELETING TUPLE IS NOT POSSIBLE

del NAME[2]

TypeError: 'tuple' object doesn't support item deletion

In [54]:
NAME=('PRABHANSHU','VALENTINA','CHANDRAKANT','ABINASH','SRAVANI')
AGE=(25,28,28,30,30)

In [55]:
NAME

('PRABHANSHU', 'VALENTINA', 'CHANDRAKANT', 'ABINASH', 'SRAVANI')

In [56]:
AGE

(25, 28, 28, 30, 30)

In [57]:
# APPENDING TUPLE VALUES
FULL_DETAILS=NAME+AGE
FULL_DETAILS

('PRABHANSHU',
 'VALENTINA',
 'CHANDRAKANT',
 'ABINASH',
 'SRAVANI',
 25,
 28,
 28,
 30,
 30)

In [ ]:
# TUPLE CAN NOT BE UPDATED OR DELETED
# TUPLE CAN BE APPENDED

In [ ]:
# CAN SET BE UPDATED DELETED AND APPNDED

In [58]:
NAME={'PRABHANSHU','VALENTINA','CHANDRAKANT','ABINASH','SRAVANI'}

In [59]:
NAME[2]='LISA'

NAME

TypeError: 'set' object does not support item assignment

In [60]:
del NAME[2]

TypeError: 'set' object doesn't support item deletion

In [61]:
NAME={'PRABHANSHU','VALENTINA','CHANDRAKANT','ABINASH','SRAVANI'}
AGE={25,28,28,30,30}

In [62]:
FULL_DETAILS=NAME+AGE
FULL_DETAILS

TypeError: unsupported operand type(s) for +: 'set' and 'set'

In [ ]:
# SET CAN NOT BE UPDATED,DELETED AND APPENDED

In [63]:
# CAN DICTIONARY BE APPENDED, DELETED AND UPDATED
STU_DETAILS={'SATISH':'BTECH','MENAKA':'MCA','PRABHAKAR':'BE','KOMAL':'BSC'}
STU_DETAILS

{'SATISH': 'BTECH', 'MENAKA': 'MCA', 'PRABHAKAR': 'BE', 'KOMAL': 'BSC'}

In [64]:
type(STU_DETAILS)

dict

In [65]:
STU_DETAILS[0]

KeyError: 0

In [66]:
STU_DETAILS[1]

KeyError: 1

In [67]:
STU_DETAILS['SATISH']

'BTECH'

In [ ]:
# IN THE  DISCTIONARY WE HAVE 2 OBJECTS
# 1. KEYS
# 2. VALUES

In [68]:
STU_DETAILS.keys()

dict_keys(['SATISH', 'MENAKA', 'PRABHAKAR', 'KOMAL'])

In [70]:
STU_DETAILS.values()

dict_values(['BTECH', 'MCA', 'BE', 'BSC'])

In [71]:
# UPDATING DICTIONARY
STU_DETAILS['SATISH']='MBA'
STU_DETAILS

{'SATISH': 'MBA', 'MENAKA': 'MCA', 'PRABHAKAR': 'BE', 'KOMAL': 'BSC'}

In [ ]:
STU_DETAILS['SATISH']

In [72]:
# DELETING DICTIONARY

del STU_DETAILS['SATISH']
STU_DETAILS

{'MENAKA': 'MCA', 'PRABHAKAR': 'BE', 'KOMAL': 'BSC'}

In [73]:
# CAN DICTIONARY BE APPENDED

STU_EDUCATION={'SATISH':'BTECH','MENAKA':'MCA','PRABHAKAR':'BE','KOMAL':'BSC'}
STU_AGE={'SATISH':23,'MENAKA':34,'PRABHAKAR':35,'KOMAL':27}

STU_EDUCATION

{'SATISH': 'BTECH', 'MENAKA': 'MCA', 'PRABHAKAR': 'BE', 'KOMAL': 'BSC'}

In [74]:
STU_AGE

{'SATISH': 23, 'MENAKA': 34, 'PRABHAKAR': 35, 'KOMAL': 27}

In [ ]:
# WE CAN NOT APPEND TEH DICTIONARY DIRECTLY

# HOW TO CREATE TEMPORARY TABLE IN PYTHON

In [75]:
# TO CRAETE A TABLE IN PYTHON PROFRAMMING

import pandas as pd

EMPLOYEE_MASTER=pd.DataFrame({'EMP_NAME':['PRABHANSHU','VALENTINA','CHANDRAKANT','ABINASH','SRAVANI'],
                              'AGE':[25,28,28,30,30],
                              'EXPERIENCE':[2,5,5,7,6],
                              'EDUCATION':['BTECH','BCA','BCOM','BTECH','MTECH'],
                              'DOJ':['01/23/2019','02/18/2020','01/23/2020','05/20/2019','01/23/2021'],
                              'SALARY':[70000,90000,120000,132000,1450000]})
EMPLOYEE_MASTER

      EMP_NAME  AGE  EXPERIENCE EDUCATION         DOJ   SALARY
0   PRABHANSHU   25           2     BTECH  01/23/2019    70000
1    VALENTINA   28           5       BCA  02/18/2020    90000
2  CHANDRAKANT   28           5      BCOM  01/23/2020   120000
3      ABINASH   30           7     BTECH  05/20/2019   132000
4      SRAVANI   30           6     MTECH  01/23/2021  1450000

In [76]:
print(EMPLOYEE_MASTER)

      EMP_NAME  AGE  EXPERIENCE EDUCATION         DOJ   SALARY
0   PRABHANSHU   25           2     BTECH  01/23/2019    70000
1    VALENTINA   28           5       BCA  02/18/2020    90000
2  CHANDRAKANT   28           5      BCOM  01/23/2020   120000
3      ABINASH   30           7     BTECH  05/20/2019   132000
4      SRAVANI   30           6     MTECH  01/23/2021  1450000

# HOW TO READ A TABLE PART-1

In [77]:
EMPLOYEE_MASTER.shape

(5, 6)

In [78]:
EMPLOYEE_MASTER.columns.values

array(['EMP_NAME', 'AGE', 'EXPERIENCE', 'EDUCATION', 'DOJ', 'SALARY'],
      dtype=object)

In [79]:
EMPLOYEE_MASTER.head(2)

     EMP_NAME  AGE  EXPERIENCE EDUCATION         DOJ  SALARY
0  PRABHANSHU   25           2     BTECH  01/23/2019   70000
1   VALENTINA   28           5       BCA  02/18/2020   90000

In [80]:
EMPLOYEE_MASTER.tail(2)

  EMP_NAME  AGE  EXPERIENCE EDUCATION         DOJ   SALARY
3  ABINASH   30           7     BTECH  05/20/2019   132000
4  SRAVANI   30           6     MTECH  01/23/2021  1450000

In [81]:
EMPLOYEE_MASTER.describe()

            AGE  EXPERIENCE        SALARY
count   5.00000    5.000000  5.000000e+00
mean   28.20000    5.000000  3.724000e+05
std     2.04939    1.870829  6.028920e+05
min    25.00000    2.000000  7.000000e+04
25%    28.00000    5.000000  9.000000e+04
50%    28.00000    5.000000  1.200000e+05
75%    30.00000    6.000000  1.320000e+05
max    30.00000    7.000000  1.450000e+06

In [82]:
EMPLOYEE_MASTER.dtypes

EMP_NAME      object
AGE            int64
EXPERIENCE     int64
EDUCATION     object
DOJ           object
SALARY         int64
dtype: object

# HOW TO CREATE A TABLE BY INSERTING VALUES INTO THE TABLE

In [83]:
import pandas as pd

STU_ALL_ENQ=['STU_ID','STU_NAME','AGE','GENDER','EDUCATION','YOE','DOE','COURSE']
STU_ALL_ENQ

['STU_ID', 'STU_NAME', 'AGE', 'GENDER', 'EDUCATION', 'YOE', 'DOE', 'COURSE']

In [84]:
STU_ALL_ENQ_FULL=pd.DataFrame(columns=STU_ALL_ENQ)
STU_ALL_ENQ_FULL

Empty DataFrame
Columns: [STU_ID, STU_NAME, AGE, GENDER, EDUCATION, YOE, DOE, COURSE]
Index: []

In [85]:
LIST_OF_VALUES=[pd.Series(['S1','NARENDRA',33,'MALE','BTECH',4,'01-01-2020','DATA SCIENCE'],index=STU_ALL_ENQ_FULL.columns),
                 pd.Series(['S2','CHHABA',24,'MALE','BTECH',2,'02-01-2020','DATA SCIENCE'],index=STU_ALL_ENQ_FULL.columns),
                 pd.Series(['S3','NARI',27,'FEMALE','BTECH',6,'04-01-2020','DATA ANALYTICS'],index=STU_ALL_ENQ_FULL.columns),
                  pd.Series(['S4','PAPPU',32,'MALE','BTECH',4,'07-01-2020','DATA SCIENCE'],index=STU_ALL_ENQ_FULL.columns),
                  pd.Series(['S5','PRACHI',30,'FEMALE','BTECH',4,'07-03-2020','DATA SCIENCE'],index=STU_ALL_ENQ_FULL.columns)]
STU_ALL_ENQ_FULL = STU_ALL_ENQ_FULL.append(LIST_OF_VALUES, ignore_index=False)

STU_ALL_ENQ_FULL

  STU_ID  STU_NAME AGE  GENDER EDUCATION YOE         DOE          COURSE
0     S1  NARENDRA  33    MALE     BTECH   4  01-01-2020    DATA SCIENCE
1     S2    CHHABA  24    MALE     BTECH   2  02-01-2020    DATA SCIENCE
2     S3      NARI  27  FEMALE     BTECH   6  04-01-2020  DATA ANALYTICS
3     S4     PAPPU  32    MALE     BTECH   4  07-01-2020    DATA SCIENCE
4     S5    PRACHI  30  FEMALE     BTECH   4  07-03-2020    DATA SCIENCE

# HOW TO READ A TABLE PART-2

In [86]:
STU_ALL_ENQ_FULL.shape

(5, 8)

In [87]:
STU_ALL_ENQ_FULL.dtypes

STU_ID       object
STU_NAME     object
AGE          object
GENDER       object
EDUCATION    object
YOE          object
DOE          object
COURSE       object
dtype: object

In [88]:
STU_ALL_ENQ_FULL.describe()

       STU_ID  STU_NAME  AGE GENDER EDUCATION  YOE         DOE        COURSE
count       5         5    5      5         5    5           5             5
unique      5         5    5      2         1    3           5             2
top        S1  NARENDRA   33   MALE     BTECH    4  01-01-2020  DATA SCIENCE
freq        1         1    1      3         5    3           1             4

In [89]:
STU_ALL_ENQ_FULL.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5 entries, 0 to 4
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   STU_ID     5 non-null      object
 1   STU_NAME   5 non-null      object
 2   AGE        5 non-null      object
 3   GENDER     5 non-null      object
 4   EDUCATION  5 non-null      object
 5   YOE        5 non-null      object
 6   DOE        5 non-null      object
 7   COURSE     5 non-null      object
dtypes: object(8)
memory usage: 360.0+ bytes

In [90]:
STU_ALL_ENQ_FULL.head(5)

  STU_ID  STU_NAME AGE  GENDER EDUCATION YOE         DOE          COURSE
0     S1  NARENDRA  33    MALE     BTECH   4  01-01-2020    DATA SCIENCE
1     S2    CHHABA  24    MALE     BTECH   2  02-01-2020    DATA SCIENCE
2     S3      NARI  27  FEMALE     BTECH   6  04-01-2020  DATA ANALYTICS
3     S4     PAPPU  32    MALE     BTECH   4  07-01-2020    DATA SCIENCE
4     S5    PRACHI  30  FEMALE     BTECH   4  07-03-2020    DATA SCIENCE

In [91]:
STU_ALL_ENQ_FULL.tail(5)

  STU_ID  STU_NAME AGE  GENDER EDUCATION YOE         DOE          COURSE
0     S1  NARENDRA  33    MALE     BTECH   4  01-01-2020    DATA SCIENCE
1     S2    CHHABA  24    MALE     BTECH   2  02-01-2020    DATA SCIENCE
2     S3      NARI  27  FEMALE     BTECH   6  04-01-2020  DATA ANALYTICS
3     S4     PAPPU  32    MALE     BTECH   4  07-01-2020    DATA SCIENCE
4     S5    PRACHI  30  FEMALE     BTECH   4  07-03-2020    DATA SCIENCE

# HOW TO DROP,DELETE AND TRUNCATE A TABLE

In [92]:
del (STU_ALL_ENQ_FULL)

In [93]:
STU_ALL_ENQ_FULL

NameError: name 'STU_ALL_ENQ_FULL' is not defined

In [94]:
import pandas as pd
STU_ALL_ENQ=['STU_ID','STU_NAME','AGE','GENDER','EDUCATION','YOE','DOE','COURSE']

STU_ALL_ENQ_FULL=pd.DataFrame(columns=STU_ALL_ENQ)

LIST_OF_VALUES=[pd.Series(['S1','NARENDRA',33,'MALE','BTECH',4,'01-01-2020','DATA SCIENCE'],index=STU_ALL_ENQ_FULL.columns),
                 pd.Series(['S2','CHHABA',24,'MALE','BTECH',2,'02-01-2020','DATA SCIENCE'],index=STU_ALL_ENQ_FULL.columns),
                 pd.Series(['S3','NARI',27,'FEMALE','BTECH',6,'04-01-2020','DATA ANALYTICS'],index=STU_ALL_ENQ_FULL.columns),
                  pd.Series(['S4','PAPPU',32,'MALE','BTECH',4,'07-01-2020','DATA SCIENCE'],index=STU_ALL_ENQ_FULL.columns),
                  pd.Series(['S5','PRACHI',30,'FEMALE','BTECH',4,'07-03-2020','DATA SCIENCE'],index=STU_ALL_ENQ_FULL.columns)]
STU_ALL_ENQ_FULL = STU_ALL_ENQ_FULL.append(LIST_OF_VALUES, ignore_index=False)

STU_ALL_ENQ_FULL

  STU_ID  STU_NAME AGE  GENDER EDUCATION YOE         DOE          COURSE
0     S1  NARENDRA  33    MALE     BTECH   4  01-01-2020    DATA SCIENCE
1     S2    CHHABA  24    MALE     BTECH   2  02-01-2020    DATA SCIENCE
2     S3      NARI  27  FEMALE     BTECH   6  04-01-2020  DATA ANALYTICS
3     S4     PAPPU  32    MALE     BTECH   4  07-01-2020    DATA SCIENCE
4     S5    PRACHI  30  FEMALE     BTECH   4  07-03-2020    DATA SCIENCE

In [95]:
# HOW TO TRUNCATE A TABLE
STU_ALL_ENQ_FULL=STU_ALL_ENQ_FULL.iloc[0:0]
STU_ALL_ENQ_FULL

Empty DataFrame
Columns: [STU_ID, STU_NAME, AGE, GENDER, EDUCATION, YOE, DOE, COURSE]
Index: []

In [96]:
import pandas as pd
STU_ALL_ENQ=['STU_ID','STU_NAME','AGE','GENDER','EDUCATION','YOE','DOE','COURSE']

STU_ALL_ENQ_FULL=pd.DataFrame(columns=STU_ALL_ENQ)

LIST_OF_VALUES=[pd.Series(['S1','NARENDRA',33,'MALE','BTECH',4,'01-01-2020','DATA SCIENCE'],index=STU_ALL_ENQ_FULL.columns),
                 pd.Series(['S2','CHHABA',24,'MALE','BTECH',2,'02-01-2020','DATA SCIENCE'],index=STU_ALL_ENQ_FULL.columns),
                 pd.Series(['S3','NARI',27,'FEMALE','BTECH',6,'04-01-2020','DATA ANALYTICS'],index=STU_ALL_ENQ_FULL.columns),
                  pd.Series(['S4','PAPPU',32,'MALE','BTECH',4,'07-01-2020','DATA SCIENCE'],index=STU_ALL_ENQ_FULL.columns),
                  pd.Series(['S5','PRACHI',30,'FEMALE','BTECH',4,'07-03-2020','DATA SCIENCE'],index=STU_ALL_ENQ_FULL.columns)]
STU_ALL_ENQ_FULL = STU_ALL_ENQ_FULL.append(LIST_OF_VALUES, ignore_index=False)

STU_ALL_ENQ_FULL

  STU_ID  STU_NAME AGE  GENDER EDUCATION YOE         DOE          COURSE
0     S1  NARENDRA  33    MALE     BTECH   4  01-01-2020    DATA SCIENCE
1     S2    CHHABA  24    MALE     BTECH   2  02-01-2020    DATA SCIENCE
2     S3      NARI  27  FEMALE     BTECH   6  04-01-2020  DATA ANALYTICS
3     S4     PAPPU  32    MALE     BTECH   4  07-01-2020    DATA SCIENCE
4     S5    PRACHI  30  FEMALE     BTECH   4  07-03-2020    DATA SCIENCE

# HOW TO ADD COLUMN AND DROP COLUMN

In [97]:
# HOW TO ADD A NEW COLUMN TO THE TABLE

import numpy as np

STU_ALL_ENQ_FULL['INSTITUTE']=np.nan


STU_ALL_ENQ_FULL

,STU_ID,STU_NAME,AGE,GENDER,EDUCATION,YOE,DOE,COURSE,INSTITUTE
0,S1,NARENDRA,33,MALE,BTECH,4,01-01-2020,DATA SCIENCE,NaN
1,S2,CHHABA,24,MALE,BTECH,2,02-01-2020,DATA SCIENCE,NaN
2,S3,NARI,27,FEMALE,BTECH,6,04-01-2020,DATA ANALYTICS,NaN
3,S4,PAPPU,32,MALE,BTECH,4,07-01-2020,DATA SCIENCE,NaN
4,S5,PRACHI,30,FEMALE,BTECH,4,07-03-2020,DATA SCIENCE,NaN

In [98]:
# HOW TO DROP A COLUMN

STU_ALL_ENQ_FULL_v1=STU_ALL_ENQ_FULL.drop('INSTITUTE',axis='columns')

STU_ALL_ENQ_FULL_v1

  STU_ID  STU_NAME AGE  GENDER EDUCATION YOE         DOE          COURSE
0     S1  NARENDRA  33    MALE     BTECH   4  01-01-2020    DATA SCIENCE
1     S2    CHHABA  24    MALE     BTECH   2  02-01-2020    DATA SCIENCE
2     S3      NARI  27  FEMALE     BTECH   6  04-01-2020  DATA ANALYTICS
3     S4     PAPPU  32    MALE     BTECH   4  07-01-2020    DATA SCIENCE
4     S5    PRACHI  30  FEMALE     BTECH   4  07-03-2020    DATA SCIENCE

# DATA IMPORTING IN PYTHON READING FROM EXCEL,CSV AND TXT FILE, DATABASE FILES

In [99]:
# IMPORTING DATA FROM EXCEL FILE

import pandas as pd

MED_2022=pd.read_excel(r'C:\Users\Debendra\CRASH COURSE 2022\PART-1\A2.RAW_DATA\MED_STORE_2022.xlsx',sheet_name='MED_AUS_DATA')

MED_2022

,CUSTOMER_ID,Company,CARD_REG_DATE,CARD_ACTIVE,FIRST_USE_DTE,firstSTOR,TITLE,GENDER,max spent,DOB,...,CUST_STAT,Avgsize spent,CARD_STAT,RGSTN_TYPE_IND,NO_OF_TRIPS,TOWN,EMAIL_IND,CONTACT_PREF,Average_Qty_PER_ACC,Spent amount
0,1000032547,MED +,2006-09-12 00:00:00,Y,2007-05-12 00:00:00,2587,Mrs.,Female,56.31,1984-09-15,...,Active,17.34,Registered,Online,4,Kyabram,Y,Email,2.75,69.37
1,1000032548,DR.REDDYS,2006-09-12 00:00:00,Y,2007-03-12 00:00:00,4341,Ms.,Female,598.95,1974-07-15,...,Active,29.32,Registered,Online,17,Hawthorn East,Y,Email,7.29,498.50
2,1000032549,RELEGARE,2006-09-12 00:00:00,Y,2007-02-12 00:00:00,1090,Mrs.,Female,1.56,1959-04-01,...,Active,1.56,Registered,Online,1,Revesby,Y,Email,2.00,1.56
3,1000032550,GSK,2006-09-12 00:00:00,Y,2007-03-12 00:00:00,3179,Mr.,Male,115.76,1978-05-16,...,Active,80.49,Registered,Online,2,Willow Grove,Y,Email,26.00,160.98
4,1000032551,GSK,2006-09-12 00:00:00,Y,2007-05-12 00:00:00,3135,Mr.,Male,305.90,1978-12-16,...,Active,24.09,Registered,Online,12,mona vale,Y,Email,6.33,289.10
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5107,1000037830,RELEGARE,2008-05-06 00:00:00,Y,2009-05-02 00:00:00,3381,Mr.,Male,198.36,1935-11-23,...,Active,66.12,Registered,Online,3,Kyvalley,N,NaN,21.33,198.36
5108,1000037831,APPOLO,2008-05-06 00:00:00,Y,2008-10-06 00:00:00,3244,Mrs.,Female,28.09,1956-08-27,...,Active,28.09,Registered,Online,1,frankston,Y,Email,10.00,28.09
5109,1000037832,GSK,2008-05-06 00:00:00,Y,2009-05-04 00:00:00,3381,Mrs.,Female,653.10,1982-05-13,...,Active,94.77,Registered,Phone,9,KYABRAM,N,NaN,27.44,852.98
5110,1000037833,MED +,2008-05-06 00:00:00,Y,2009-06-10 00:00:00,3130,Ms.,Female,228.55,1960-01-14,...,Active,38.09,Registered,Online,6,Mulgrave,Y,Email,8.00,228.55
5111,1000037834,RANBAXY,2008-05-06 00:00:00,Y,2009-05-04 00:00:00,3363,Mrs.,Female,26.35,1971-12-22,...,Active,26.35,Registered,Instore/RF,1,WODONGA,Y,NaN,7.00,26.35

In [100]:
MED_2022.shape

(5112, 24)

In [101]:
MED_2022.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5112 entries, 0 to 5111
Data columns (total 24 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   CUSTOMER_ID          5112 non-null   int64
 1   Company              5112 non-null   object
 2   CARD_REG_DATE        5112 non-null   object
 3   CARD_ACTIVE          5112 non-null   object
 4   FIRST_USE_DTE        5112 non-null   object
 5   firstSTOR            5112 non-null   int64
 6   TITLE                5112 non-null   object
 7   GENDER               5112 non-null   object
 8   max spent            5097 non-null   float64
 9   DOB                  5112 non-null   datetime64[ns]
 10  FTD                  5112 non-null   object
 11  Age                  5112 non-null   int64
 12  STATE_CODE           5112 non-null   object
 13  POST_CODE            5112 non-null   int64
 14  CUST_STAT            5112 non-null   object
 15  Avgsize spent        5112 non-null   float64
 16  CARD_STAT            5112 non-null   object
 17  RGSTN_TYPE_IND       5112 non-null   object
 18  NO_OF_TRIPS          5112 non-null   int64
 19  TOWN                 5112 non-null   object
 20  EMAIL_IND            5112 non-null   object
 21  CONTACT_PREF         4219 non-null   object
 22  Average_Qty_PER_ACC  5112 non-null   float64
 23  Spent amount         5112 non-null   float64
dtypes: datetime64[ns](1), float64(4), int64(5), object(14)
memory usage: 958.6+ KB

In [102]:
# IMPORTING DATA FROM CSV FILE

import pandas as pd

MED_2022_CSV=pd.read_csv(r'C:\Users\Debendra\CRASH COURSE 2022\PART-1\A2.RAW_DATA\MED_STORE_2022.csv')

MED_2022_CSV

,CUSTOMER_ID,Company,CARD_REG_DATE,CARD_ACTIVE,FIRST_USE_DTE,firstSTOR,TITLE,GENDER,max spent,DOB,...,CUST_STAT,Avgsize spent,CARD_STAT,RGSTN_TYPE_IND,NO_OF_TRIPS,TOWN,EMAIL_IND,CONTACT_PREF,Average_Qty_PER_ACC,Spent amount
0,1000032547,MED +,12-09-2006 00:00,Y,12-05-2007 00:00,2587,Mrs.,Female,56.31,15-09-1984,...,Active,17.34,Registered,Online,4,Kyabram,Y,Email,2.75,69.37
1,1000032548,DR.REDDYS,12-09-2006 00:00,Y,12-03-2007 00:00,4341,Ms.,Female,598.95,15-07-1974,...,Active,29.32,Registered,Online,17,Hawthorn East,Y,Email,7.29,498.50
2,1000032549,RELEGARE,12-09-2006 00:00,Y,12-02-2007 00:00,1090,Mrs.,Female,1.56,01-04-1959,...,Active,1.56,Registered,Online,1,Revesby,Y,Email,2.00,1.56
3,1000032550,GSK,12-09-2006 00:00,Y,12-03-2007 00:00,3179,Mr.,Male,115.76,16-05-1978,...,Active,80.49,Registered,Online,2,Willow Grove,Y,Email,26.00,160.98
4,1000032551,GSK,12-09-2006 00:00,Y,12-05-2007 00:00,3135,Mr.,Male,305.90,16-12-1978,...,Active,24.09,Registered,Online,12,mona vale,Y,Email,6.33,289.10
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5107,1000037830,RELEGARE,06-05-2008 00:00,Y,02-05-2009 00:00,3381,Mr.,Male,198.36,23-11-1935,...,Active,66.12,Registered,Online,3,Kyvalley,N,NaN,21.33,198.36
5108,1000037831,APPOLO,06-05-2008 00:00,Y,06-10-2008 00:00,3244,Mrs.,Female,28.09,27-08-1956,...,Active,28.09,Registered,Online,1,frankston,Y,Email,10.00,28.09
5109,1000037832,GSK,06-05-2008 00:00,Y,04-05-2009 00:00,3381,Mrs.,Female,653.10,13-05-1982,...,Active,94.77,Registered,Phone,9,KYABRAM,N,NaN,27.44,852.98
5110,1000037833,MED +,06-05-2008 00:00,Y,10-06-2009 00:00,3130,Ms.,Female,228.55,14-01-1960,...,Active,38.09,Registered,Online,6,Mulgrave,Y,Email,8.00,228.55
5111,1000037834,RANBAXY,06-05-2008 00:00,Y,04-05-2009 00:00,3363,Mrs.,Female,26.35,22-12-1971,...,Active,26.35,Registered,Instore/RF,1,WODONGA,Y,NaN,7.00,26.35

In [ ]:
# IMPORTING DATA FROM TXT FILE

import pandas as pd

MED_2022_txt=pd.read_csv(r'C:\Users\Debendra\CRASH COURSE 2022\PART-1\A2.RAW_DATA\MED_STORE_2022.txt',sep=',')

MED_2022_txt

# DATA EXPORTING FROM PYTHON TO EXCEL,CSV AND TXT FILE

In [ ]:
# EXPORTING DATA FROM PYTHON TO EXCEL CSV AND TXT FILE

import pandas as pd

MED_2022.to_excel(r'C:\Users\Debendra\CRASH COURSE 2022\PART-1\A4.OUTPUT\MED_2022_EXP.xlsx',sheet_name='MED_AUS_EXP')

MED_2022.to_csv(r'C:\Users\Debendra\CRASH COURSE 2022\PART-1\A4.OUTPUT\MED_2022_EXP.csv')

MED_2022.to_csv(r'C:\Users\Debendra\CRASH COURSE 2022\PART-1\A4.OUTPUT\MED_2022_EXP.txt',sep='|')

In [ ]:
# EXPORTING DATA FROM PYTHON TO EXCEL CSV AND TXT FILE

import pandas as pd

MED_2022.to_excel(r'C:\Users\Debendra\CRASH COURSE 2022\PART-1\A4.OUTPUT\MED_2022_EXP.xlsx',sheet_name='MED_AUS_EXP')

In [ ]:
# HOW TO CONNECT TO SQL SERVER DATABASE

import pandas as pd
import pyodbc 

conn = pyodbc.connect('Driver={SQL Server};'
                      'Server=RON\SQLEXPRESS;'
                      'Database=test_database;'
                      'Trusted_Connection=yes;')

df = pd.read_sql_query('SELECT * FROM products', conn)

print(df)

In [ ]:
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="devd",
  password="das@123",
  database="Batch_202112"
)

mycursor = mydb.cursor()

mycursor.execute("SELECT * FROM MED_2022")

myresult = mycursor.fetchall()

for x in myresult:
print(x)

# HOW TO DESCRIBE A TABLE BY SHAPE,HEAD,TAIL,COLUMNS.VALUES,DTYPE,INFO(),DESCRIBE()

In [ ]:
MED_2022.shape

In [ ]:
MED_2022.info()

In [ ]:
MED_2022.describe()

In [ ]:
MED_2022.dtypes

In [ ]:
MED_2022.head(100)

In [ ]:
MED_2022.tail(100)

# HOW TO CREATE A NEW TABLE FROM AN EXISTING TABLE

In [ ]:
MED_2022_V1=MED_2022.copy (deep=True)

MED_2022_V1

In [ ]:
MED_2022_V1=MED_2022[['CUSTOMER_ID','Company','GENDER','Age']]

MED_2022_V1

In [ ]:
MED_2022_V1=MED_2022[['CUSTOMER_ID','Company','GENDER','Age']][0:100]

MED_2022_V1

In [ ]:
MED_2022.CONTACT_PREF.isnull()

In [103]:
#TO GET COUNT OF MISSING RECORDS

import pandas as pd 
import numpy as np    
  
# total count of NaN values
print(MED_2022.CONTACT_PREF.isnull().sum().sum())

893

In [104]:
#TO GET COUNT OF MISSING RECORDS- DATAFRAME EXAMPLE

import pandas as pd 
import numpy as np
    
# dictionary of lists 
dict = {'A':[1, 4, 6, 9],
        'B':[np.NaN, 5, 8, np.NaN],
        'C':[7, 3, np.NaN, 2],
        'D':[1, np.NaN, np.NaN, np.NaN]} 
    
# creating dataframe from the
# dictionary 
data = pd.DataFrame(dict) 
  
# total count of NaN values
print(data.isnull().sum().sum())

6